<img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /> 



<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />&nbsp;1&nbsp;Medium</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I03-NI-GCP</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></sub></td>

<td>src</td>

<td>UDP on all ports can enter your network from Private IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></sub></sub></sub>&nbsp;&nbsp;<h3><b>src</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />  I03-NI-GCP</summary> 

### **Title:**
UDP on all ports can enter your network from Private IPs

### **Description:**
Allowing UDP on all ports to enter your network is extremely risky since this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 
    

### **Recommendation:**
Review all the rules that allow inbound traffic with UDP on all ports, and limit them to those services you 
actually require. 

### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "i23-ni-gcp",
		"ipProtocol": "udp",
		"ipRange": [
			"192.168.1.1/32",
			"192.168.1.2/32",
			"192.168.1.3/32",
			"192.168.1.4/32",
			"192.168.1.5/32"
		]
	}
]

```

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.i23-ni-gcp will be created
  + resource "google_compute_firewall" "i23-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-multi-ip"
      + network            = "devsecops-network-gcp"
      + priority           = 1400
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
          + "192.168.1.2/32",
          + "192.168.1.3/32",
          + "192.168.1.4/32",
          + "192.168.1.5/32",
        ]

      + allow {
          + ports    = [
              + "137",
              + "138",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 1460
      + name                            = "devsecops-network-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\tmp\tf-src.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\\tmp\\tf-src.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @Artsemil<br>
Action: `pull_request`<br>
Working Directory: /home/runner/work/ForTraining/ForTraining<br>
Workflow: Test Repo CI/CD